### Задача 1
Что выведет программа?
**Пример:**
```python
x = 10

def change_value():
    x = 20 

change_value()
print(x)  # что выведет программа?
```

### Задача 2
Что выведет программа?
```python
y = 5

def modify_global():
    global y
    y = 10 

modify_global()
print(y)  # что выведет программа?
```

### Задача 3
Что выведет программа?
```python
a = 100

def shadow_variable():
    a = 200 

shadow_variable()
print(a)  # что выведет программа?
```

### Задача 4
Что выведет программа?
```python
z = 50 

def modify_variable(value):
    value = value * 2 
    return value

z = modify_variable(z) 
print(z)  # что выведет программа?
```

### Задача 5
Что выведет программа?
```python
s = "Hello"

def modify_string(string):
    string = string + " World"

modify_string(s)
print(s)  # что выведет программа?
```

### Задача 6
Что выведет программа?
```python
n = 10 

def first_function():
    global n
    n = 20

def second_function():
    first_function()

second_function()
print(n)  # что выведет программа?
```

### Задача 7
Что выведет программа?
```python
lst = [1, 2, 3] 
s = "Hello" 

def modify_list(l):
    l.append(4)

def modify_string(st):
    st += " World"

modify_list(lst)
modify_string(s)

print(lst)  # что выведет программа?
print(s)  # что выведет программа?
```


# Задачи на модули

### Задача 1: Простое использование модуля
Создайте два файла: один будет содержать основной код, а второй — модуль с функциями.

**Условия:**
1. Создайте файл `math_operations.py`, в котором определите две функции:
    - Функция `add(a, b)`, которая возвращает сумму двух чисел.
    - Функция `multiply(a, b)`, которая возвращает произведение двух чисел.
2. В основном файле импортируйте функции из модуля и используйте их для выполнения операций.

### Задача 2: Переименование модуля при импорте
Измените имена импортируемых функций с помощью ключевого слова `as`, чтобы избежать конфликтов имен и сделать код более читаемым.

**Условия:**
1. Используйте тот же модуль `math_operations`, но импортируйте функции с переименованными именами (импортируйте `math_operations` как `mo`).
2. Измените имена так, чтобы функции `add` и `multiply` стали `sum_` и `prod_` соответственно.


### Задача 3: Использование `__name__ == "__main__"`
Создайте модуль, который при импорте выполняет функцию, а при прямом запуске будет выводить "Это главный модуль".

**Условия:**
1. Создайте файл `test_module.py`, в котором:
    - При прямом запуске модуля выводится строка `"Это главный модуль"`.
    - При импорте модуля вызывается функция, которая выводит `"Этот модуль был импортирован"`.
   
### Задача 4: Создание собственного модуля
Напишите модуль, который предоставляет несколько функций для работы с датами, и используйте его в основном файле.

**Условия:**
1. Напишите модуль `date_utils.py`, который будет содержать:
    - Функцию `get_current_date()`, возвращающую текущую дату в формате `YYYY-MM-DD`.
    - Функцию `days_between(date1, date2)`, которая возвращает количество дней между двумя датами.
2. Используйте этот модуль в основном файле, чтобы получить текущую дату и рассчитать количество дней между двумя датами.


### Задача 5: Использование встроенных модулей
Напишите программу, которая использует стандартные модули для выполнения нескольких задач.

**Условия:**
1. Используйте модуль `random` для генерации случайного числа в диапазоне от 1 до 100.
2. Используйте модуль `datetime` для получения текущей даты и времени.

